
public class MainClass {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 식별자
		// 프로그래밍 언어에서 개발자가 만들어 사용하는 요소들을 구분하기 위해
		// 붙혀주는 이름
		
		// 문법적으로 지켜야 하는 규칙
		// 1. 길이에 제한이 없다.
		// 2. 첫 글자는 문자, _, $ 만 가능하다.
		// 3. 두 번째 글자 부터는 문자, 숫자, _, $ 를 사용할 수 있다.
		// 4. 한글 등도 가능하다...
		
		// 자바에서의 권장사항
		// 1. 변수는 첫 글자를 소문자로 한다.
		// 2. 메서드는 첫 글자를 소문자로 한다.
		// 3. 클래스는 첫 글자를 대분자로 한다.
		// 4. 상수를 의미하는 것들은 모두 대문자로 작성한다.
		
		// 표기 기법
		// 1. 잘못된 표기 예
		// koreanpointavg
		// korean point avg
		// 2. 파스칼 표기 기법 : 단어와 단어사이에 언더바(_)를 두는 표기 기법
		// korean_point_avg, car_count
		// 자바에서는 상수를 의미하는 것들을 사용할 때...
		// 3. 카멜 표기 기법 : 각 단어의 첫 글자를 대문자로 작성하는 표기 기법
		// koreanPointAvg, carCount
		// 자바에서는 상수를 의미하는 것들외의 모든 것들을 사용할 때...
		
	}

}





